package day0118;
// 주석 ( Comment )
// 주석이란? 우리가 소스파일 안에 적는 설명으로써
// 실제 컴파일 단계에서는 무시가 되는 글자들이다.
// 주석이 아닌 모든 것들은 코드로써
// 자바의 엄격한 문법에 어긋나지 않아야 하지만
// 주석들은 무시가 되기 때문에 우리가 문법을 안 지켜줘도 된다!!

// 주석은 주로 어떤 코드에 대한 설명을 적게 된다.
// 해당 코드가 어떤 역할을 하는지, 왜 이렇게 적었는지 등에 대한 설명을 적어서
// 이 코드를 읽는 사람들에게 설명을 하는 역할를 한다.

// 주석에는 한줄 주석과 여러줄 주석 두 가지 주석이 있다.

// 한줄 주석(라인) : // 로 시작하고 그 다음칸부터 그 줄이 끝날때까지가 주석이 된다.
// 여러줄 주석(블록) : /* 로 시작해서 */로 끝날 때까지 그 사이의 모든 줄이 주석이 된다.
/*
 * 요
 * 렇
 * 게
 * 이클립스에서는 좀 더 명확하게 주석인걸 표시하기 위해서
 * 여러줄 주석의 맨 앞에 *를 붙여주지만
 * 지워도 상관 없다.
 * 
 * 작성자 : 조재영
 * 작성일 : 2021년 01월 18일
 * 프로그램 내용: 주석에 대한 설명과 예시
 * 굳이 위의 내용까지 적어줄 필요는 없지만
 * 어느정도 난이도가 있는 코드의 경우에는 반드시
 * 주석을 달아서 설명을 해야한다.
 * 
 * 팁
 * 1. 소스코드가 변경되면 업데이트 되어야 한다. 
 *    소스코드는 변경이 되었는데 주석문은 수정을 안 하는 경우가 종종 있다. 다른 사람에게 혼란을 야기한다. 
 * 2. 현재 작성한 소스코드의 특정 부분을 잠시 사용하지 않게 만들고 싶은 경우에도 사용한다. 
 *    예를들어 기존의 코드보다 좀 더 업그레이드 된 코드를 작성하고 싶은 경우 기존 코드를 모두 삭제하고 시작하는 것이 아니라
 *    잠시 주석처리하고 새로운 코드를 만드는 것이 유리하다.
 * 3. 이클립스에서 주석처리하고 싶은 부분을 선택한 후 Ctrl + / 를 입력하면 자동으로 주석이 생성 
 *    한번 더 Ctrl + / 입력 시 주석 해제 (Toggle 된다.)
 */

public class Ex01Comment {

}
