package day0118;

//자료형(Data types)
/* 자료형이란?
 * 어떤 변수 혹은 상수에 저장할 수 있는 값의 "종류"를 말한다.
 * 
 * 변수명 앞의 int, String 등은 변수의 자료형(Type)을 뜻한다.
 * int a; 라는 문장은 다음과 같이 해석된다.
 * 변수a 는 int 자료형 변수이다. 즉 a라는 변수에는 int 자료형 값(1, 10, 25 등의 정수값)만 담을 수 있다.
 * String b; 라는 문장은 다음과 같이 해석된다.
 * 변수 b는 String 자료형 변수이다. 즉 b라는 변수에는 String 자료형 값("a", "hello" 등의 문자열값)만 담을 수 있다.
 * 
 * 자료형(Data types)에는 크게
 * 기본형(Primitive) 과 참조형(Reference) 2가지 종류가 있다.
 * 기본형 : 해당 공간에 2진법으로 변환된 값이 직접 저장된다.
 *        기본형에는 크게 다음과 같이 나눠진다.
 *        1.정수형
 *        2.실수형
 *        3.문자형
 *        4.논리형
 * 참조형 : 해당 공간에 진짜 값이 있는 곳의 주소값이 저장된다.
 *        참조형에는 크게 다음과 같이 나눠진다.
 *        이 중 특별히 클래스형 변수는 우리가 "객체"라고 부른다.
 *        1.클래스형
 *        2.배열형
 *        3.인터페이스형
 * 
 * 10진법 : 1.각자리가 0~9까지 10개의 숫자로 이루어져있다.
 *          2.각 자리가 10의 제곱을 뜻한다.
 *          34863 = 30000+4000+800+60+3
 * 2진법  : 1. 각자리가 0,1 2개의 숫자
 *          2.각 자리가 2의 제곱
 *          10011(2) = 1x2^4 + 0x2^3 + 0x2^2 + 1x2^1 + 1x2^0
 *                   = 1x16 + 0x8 + 0x4 + 1x2 + 1x1 = 19
 * 4bit = 2진법 4자리 숫자                         
 */
public class Ex03DataTypes {

}
