package day0118;
/* 기본형 데이터타입 02 - 실수형
 * 실수란?
 * 소수가 존재하는 숫자들
 * 프로그래밍에서는 2가지 실수형 데이터타입이 있다.
 * 1.float: 32bit
 * 2.double: 64bit
 * 자바의 경우, 모든 실수를 double로 인식한다.
 * 즉, double을 쓰자.
 * 
 * float pi = 3.14F;
 * double morePi = 3.14159265358979323846;
 * 자바에서 실수형은 디폴트가 double이므로 위의 예에서 보듯이 float 변수에 값을 대입할 때에는 
 * 3.14F 와 같이 F접미사(또는 소문자 f)를 꼭 붙여 주어야 한다. 
 * float 자료형에 값을 대입할 때 접미사를 누락하면 컴파일 에러가 발생한다.

 * 또는 과학적 지수 표현식으로 다음과 같이 사용할 수 있다.

 * double d1 = 123.4;
 * double d2 = 1.234e2;
 * d1과 d2의 값은 123.4로 같다. d2의 e2는 10의 제곱(102)을 의미한다. 즉 1.234∗102 이 되어 123.4 가 되는 것이다.
 * 
 */
public class Ex05RealNumber {

}
